#### Search for PK

In [6]:
%%bigquery
select count(*) from samhda_staging.samhda_2012

     f0_
0  13807

In [7]:
%%bigquery
select count(distinct CASEID) from samhda_staging.samhda_2012

     f0_
0  13807

In [8]:
%%bigquery
select count(*) from samhda_staging.samhda_2014

     f0_
0  13176

In [9]:
%%bigquery
select count(distinct CASEID) from samhda_staging.samhda_2014

     f0_
0  13176

In [10]:
%%bigquery
select count(*) from samhda_staging.samhda_2015

     f0_
0  12826

In [11]:
%%bigquery
select count(distinct CASEID) from samhda_staging.samhda_2015

     f0_
0  12826

In [12]:
%%bigquery
select count(*) from samhda_staging.samhda_2016

     f0_
0  12172

In [13]:
%%bigquery
select count(distinct CASEID) from samhda_staging.samhda_2016

     f0_
0  12172

In [14]:
%%bigquery
select count(*) from samhda_staging.samhda_2017

     f0_
0  11582

In [15]:
%%bigquery
select count(distinct CASEID) from samhda_staging.samhda_2017

     f0_
0  11582

In [16]:
%%bigquery
select count(*) from samhda_staging.samhda_2018

     f0_
0  11682

In [17]:
%%bigquery
select count(distinct CASEID) from samhda_staging.samhda_2018

     f0_
0  11682

CASEID is a primary key in all the tables

#### No foreign keys in the tables because the only primary key is the CASEID for all our tables. Our data has the same columns over multiple years